It looks like the change in the attribute value not only applies to `capacity-optimized` but to all allowed values.  Below is an example for `price-capacity-optimized`. So we may need something a bit more dynamic to convert the value from AWS API to lowercase and replace `_` with `-`.

The [ListInstanceFleets](https://docs.aws.amazon.com/emr/latest/APIReference/API_ListInstanceFleets.html) API indicates that the lower-case names should be returned, as with the `AddInstanceFleet` API. So I think it's an AWS API issue that the return values is changed.

```
Terraform will perform the following actions:

  # aws_emr_cluster.test must be replaced
-/+ resource "aws_emr_cluster" "test" {
      ~ arn                               = "arn:aws:elasticmapreduce:us-east-1:100180206982:cluster/j-155I92D8MPO03" -> (known after apply)
      ~ cluster_state                     = "WAITING" -> (known after apply)
      - ebs_root_volume_size              = 0 -> null
      ~ id                                = "j-155I92D8MPO03" -> (known after apply)
      ~ keep_job_flow_alive_when_no_steps = true -> (known after apply)
      ~ master_public_dns                 = "ip-10-0-1-222.ec2.internal" -> (known after apply)
        name                              = "test-emr-cluster"
      - placement_group_config            = [] -> null
      ~ scale_down_behavior               = "TERMINATE_AT_TASK_COMPLETION" -> (known after apply)
      ~ step                              = [] -> (known after apply)
      - tags                              = {} -> null
      ~ tags_all                          = {} -> (known after apply)
      ~ termination_protection            = false -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ core_instance_fleet {
          ~ id                             = "if-170H4L2GSMMH0" -> (known after apply)
            name                           = "core fleet"
          ~ provisioned_on_demand_capacity = 0 -> (known after apply)
          ~ provisioned_spot_capacity      = 2 -> (known after apply)
            # (2 unchanged attributes hidden)

          - instance_type_configs {
              - bid_price_as_percentage_of_on_demand_price = 100 -> null
              - instance_type                              = "m4.2xlarge" -> null
              - weighted_capacity                          = 2 -> null

              - ebs_config {
                  - iops                 = 0 -> null
                  - size                 = 100 -> null
                  - type                 = "gp2" -> null
                  - volumes_per_instance = 1 -> null
                }
            }
          - instance_type_configs {
              - bid_price_as_percentage_of_on_demand_price = 100 -> null
              - instance_type                              = "m4.xlarge" -> null
              - weighted_capacity                          = 1 -> null

              - ebs_config {
                  - iops                 = 0 -> null
                  - size                 = 100 -> null
                  - type                 = "gp2" -> null
                  - volumes_per_instance = 1 -> null
                }
            }
          - instance_type_configs {
              - bid_price_as_percentage_of_on_demand_price = 80 -> null
              - instance_type                              = "m3.xlarge" -> null
              - weighted_capacity                          = 1 -> null

              - ebs_config {
                  - iops                 = 0 -> null
                  - size                 = 100 -> null
                  - type                 = "gp2" -> null
                  - volumes_per_instance = 1 -> null
                }
            }
          + instance_type_configs {
              + bid_price_as_percentage_of_on_demand_price = 100
              + instance_type                              = "m4.2xlarge"
              + weighted_capacity                          = 2

              + ebs_config {
                  + size                 = 100
                  + type                 = "gp2"
                  + volumes_per_instance = 1
                }
            }
          + instance_type_configs {
              + bid_price_as_percentage_of_on_demand_price = 100
              + instance_type                              = "m4.xlarge"
              + weighted_capacity                          = 1

              + ebs_config {
                  + size                 = 100
                  + type                 = "gp2"
                  + volumes_per_instance = 1
                }
            }
          + instance_type_configs {
              + bid_price_as_percentage_of_on_demand_price = 80
              + instance_type                              = "m3.xlarge"
              + weighted_capacity                          = 1

              + ebs_config {
                  + size                 = 100
                  + type                 = "gp2"
                  + volumes_per_instance = 1
                }
            }

          ~ launch_specifications {
              ~ spot_specification {
                  ~ allocation_strategy      = "PRICE_CAPACITY_OPTIMIZED" -> "price-capacity-optimized" # forces replacement
                    # (3 unchanged attributes hidden)
                }
            }
        }

      ~ ec2_attributes {
          ~ emr_managed_master_security_group = "sg-09e6cbdb8bb6a9160" -> (known after apply)
          ~ emr_managed_slave_security_group  = "sg-0f4aeda86e3b94d90" -> (known after apply)
          ~ service_access_security_group     = "sg-0b0911507cf5690c8" -> (known after apply)
          ~ subnet_ids                        = [
              - "subnet-07fc332ca6548551e",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ master_instance_fleet {
          ~ id                             = "if-1WV4SHOYW75S3" -> (known after apply)
          ~ provisioned_on_demand_capacity = 1 -> (known after apply)
          ~ provisioned_spot_capacity      = 0 -> (known after apply)
            # (2 unchanged attributes hidden)

          - instance_type_configs {
              - bid_price_as_percentage_of_on_demand_price = 100 -> null
              - instance_type                              = "m3.xlarge" -> null
              - weighted_capacity                          = 1 -> null
            }
          + instance_type_configs {
              + bid_price_as_percentage_of_on_demand_price = 100
              + instance_type                              = "m3.xlarge"
              + weighted_capacity                          = 1
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```